In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame({
    'Hourly_Salary': ['500.00', '10000.00', '200.00', '20.00', np.nan]
})

In [9]:
df["Hourly_Salary"] = df["Hourly_Salary"].astype(float)

In [10]:
# Example 1 keep only values under 1000
filtered_df = df.where(df < 1000)
filtered_df

   Hourly_Salary
0          500.0
1            NaN
2          200.0
3           20.0
4            NaN

In [11]:
# Example 2 keep under 1000, replace with another value
filtered_df = df.where(df < 1000, other = 999)
filtered_df

   Hourly_Salary
0          500.0
1          999.0
2          200.0
3           20.0
4          999.0

In [13]:
# Example 3 filling a null value
df_where_3 = df.where(df.notnull(), 0)
df_where_3

   Hourly_Salary
0          500.0
1        10000.0
2          200.0
3           20.0
4            0.0

In [14]:
df2 = pd.DataFrame({
    'Running Back': ['Barry Sanders', 'Walter Payton', 'Emmitt Smith', 'Jim Brown'],
    'Career Rushing Yards': [152690, 16726, 18355, 12312],
    'Touchdowns': [99, 110, 164, 106]
})

In [15]:
df2

    Running Back  Career Rushing Yards  Touchdowns
0  Barry Sanders                152690          99
1  Walter Payton                 16726         110
2   Emmitt Smith                 18355         164
3      Jim Brown                 12312         106

In [ ]:
# Example 4 column
df2.where(df2["Career Rushing Yards"] < 100000)

    Running Back  Career Rushing Yards  Touchdowns
0            NaN                   NaN         NaN
1  Walter Payton               16726.0       110.0
2   Emmitt Smith               18355.0       164.0
3      Jim Brown               12312.0       106.0

In [18]:
# Example 5 multiple conditions with &
df2.where( (df2["Touchdowns"] >= 99) & (df2["Career Rushing Yards"] != 18355) )

    Running Back  Career Rushing Yards  Touchdowns
0  Barry Sanders              152690.0        99.0
1  Walter Payton               16726.0       110.0
2            NaN                   NaN         NaN
3      Jim Brown               12312.0       106.0

In [ ]:
# Example 6 multiple conditions with |
filter1 = df2["Touchdowns"] < 100

In [22]:
filter2 = df2["Touchdowns"] > 150

In [23]:
df2.where(filter1 | filter2)

    Running Back  Career Rushing Yards  Touchdowns
0  Barry Sanders              152690.0        99.0
1            NaN                   NaN         NaN
2   Emmitt Smith               18355.0       164.0
3            NaN                   NaN         NaN

In [24]:
# Example 7 create a new column
df2["touchdown_totals"] = df2["Touchdowns"].where(df2["Touchdowns"] >= 100, other="Less Than 100")